In [1]:
import pandas as pd

#### 도시 ID 및 학원수

In [26]:
City = {'City_Id' : [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23 ],
        'City' : ['Beijing', 'London', 'Seoul', 'Osaka', 'NewYork',
                  'Incheon', 'Busan', 'Tokyo', 'Nagasaki', 'Shanghai', 
                  'Chicago', 'LA', 'Washington', 'Hongkong', 'Oxford', 'Sapporo'],
        'Num_of_Academy' : [50, 34, 47, 35, 33, 40, 45, 42, 34, 51, 29, 41, 39, 53, 38, 32]}

City = pd.DataFrame(City)
City

    City_Id        City  Num_of_Academy
0         8     Beijing              50
1         9      London              34
2        10       Seoul              47
3        11       Osaka              35
4        12     NewYork              33
5        13     Incheon              40
6        14       Busan              45
7        15       Tokyo              42
8        16    Nagasaki              34
9        17    Shanghai              51
10       18     Chicago              29
11       19          LA              41
12       20  Washington              39
13       21    Hongkong              53
14       22      Oxford              38
15       23     Sapporo              32

#### 기본적으로 row 보기

In [27]:
City.loc[0]

City_Id                 8
City              Beijing
Num_of_Academy         50
Name: 0, dtype: object

In [28]:
City.loc[0:2]

   City_Id     City  Num_of_Academy
0        8  Beijing              50
1        9   London              34
2       10    Seoul              47

In [33]:
City.loc[10]['City_Id']

18

In [34]:
City.loc[10]['City']

'Chicago'

In [35]:
City.loc[10]['Num_of_Academy']

29

In [36]:
City.loc[10]

City_Id                18
City              Chicago
Num_of_Academy         29
Name: 10, dtype: object

#### 도시와 학원 수를 for문 사용해 보기

In [3]:
for row in City.itertuples():
   print(row.City, row.Num_of_Academy)

Beijing 50
London 34
Seoul 47
Osaka 35
NewYork 33
Incheon 40
Busan 45
Tokyo 42
Nagasaki 34
Shanghai 51
Chicago 29
LA 41
Washington 39
Hongkong 53
Oxford 38
Sapporo 32

#### 학원 각각의 수에 10을 곱한다.

In [4]:
for row in City.itertuples():
    print(row.Num_of_Academy * 10)

500
340
470
350
330
400
450
420
340
510
290
410
390
530
380
320

#### 주요 국가 지수

In [17]:
ci = {'Country' : ['Korea', 'China', 'English', 'USA', 'Japan'],
      'Education' : [97, 95, 89, 90, 92],
      'Economy' : [89, 93, 90, 95, 92],
      'Industry' : [88, 94, 85, 95, 90]}

ci = pd.DataFrame(ci)
ci

   Country  Education  Economy  Industry
0    Korea         97       89        88
1    China         95       93        94
2  English         89       90        85
3      USA         90       95        95
4    Japan         92       92        90

#### 각 나라의 세 지수의 평균을 본다

In [18]:
ci['mean'] = 0
ci['mean']

0    0
1    0
2    0
3    0
4    0
Name: mean, dtype: int64

In [21]:
for row in ci.itertuples():
    print((row.Education + row.Economy + row.Industry)/3)

91.33333333333333
94.0
88.0
93.33333333333333
91.33333333333333